[
    {
        "id": 4,
        "name": "TU Campus Inquiry Project",
        "description": "I am developing a web application built using the MEAN stack, Bootstrap, and Nodemailer that enables students to submit inquiries/requests regarding Towson University campuses and connect with counselors. I am currently implementing secure authorization using Auth0 and improving the admin UI.",
        "link": "https://github.com/Romerico234/TU-Campus-Inquiry-Project",
        "image": "../../../images/projects-images/tu-campus-inquiry.png"
    },
    {
        "id": 3,
        "name": "Personal Portfolio",
        "description": "I developed my personal portfolio website built using React.js and TypeScript JSX (TSX). I styled the website using Bootstrap and vanilla CSS and deployed the project on Netlify with a custom URL.",
        "link": "https://github.com/Romerico234/Personal-Portfolio",
        "image": "../../../images/projects-images/personal-portfolio.png"
    },
    {
        "id": 2,
        "name": "Murder Mystery Project",
        "description": "I developed a text-based storyline interactive game in Java that focuses on a murder mystery where the player explores a crime scene, finds evidence, investigates clues, and reaches a conclusion. This is the project's second revision, where I refactored the code to include fundamental object-oriented programming principles such as Abstraction, Encapsulation, Inheritance, and Polymorphism.",
        "link": "https://github.com/Romerico234/Murder-Mystery-Project",
        "image": "../../../images/projects-images/murder-mystery.png"
    },
    {
        "id": 1,
        "name": "Nonlinear ODEs and Linear PDEs Equivalence Project",
        "description": "This was a group research project for my Ordinary Differential Equations class that focuses on the transformations and equivalence of nonlinear ODEs and linear PDEs in the context of Fluid Dynamics. I independently created a LaTeX file to provide an alternative format for our presentation.",
        "link": "https://github.com/Romerico234/Nonlinear-ODEs-and-Linear-PDEs-Equivalence-in-Fluid-Dynamics",
        "image": "../../../images/projects-images/differential-equations-equivalence.png"
    }
]
