[
    {
        "id": 4,
        "name": "Towson Academic Planner (TAP)",
        "description": "Towson Academic Pathway (TAP) is a web application designed to simplify academic planning for Towson University students. It is built with React on the frontend and MongoDB and Express on the backend. TAP leverages AI to generate personalized degree plans. Key features include a drag-and-drop interface for organizing degree plans, an integrated course catalog for browsing and adding courses, a dedicated page for viewing Towson University requirements, and more. TAP provides an intuitive, efficient, and stress-free solution to the challenges of manual academic planning. Possibly big things coming from this project 👀.",
        "link": "https://github.com/Romerico234/Towson-Academic-Pathway",
        "image": "../../../images/projects-images/tap-dcp.png"
    },
    {
        "id": 3,
        "name": "nVolve",
        "description": "nVolve is an iOS app designed to increase student participation in Towson University campus events by addressing the challenges of low attendance caused by ineffective marketing and overlooked emails. It is built using Swift and the app provides real-time notifications for upcoming events, a centralized platform to browse campus activities, and an interactive campus map with markers for events happening for the current day. nVolve streamlines event discovery and makes it easier for students to stay informed and engaged with their campus community.",
        "link": "https://github.com/Romerico234/nVolve",
        "image": "../../../images/projects-images/nvolve.jpg"
    },
    {
        "id": 2,
        "name": "Murder Mystery Project",
        "description": "I developed a text-based storyline interactive game in Java that focuses on a murder mystery where the player explores a crime scene, finds evidence, investigates clues, and reaches a conclusion. This is the project's second revision, where I refactored the code to include fundamental object-oriented programming principles such as Abstraction, Encapsulation, Inheritance, and Polymorphism.",
        "link": "https://github.com/Romerico234/Murder-Mystery-Project",
        "image": "../../../images/projects-images/murder-mystery.png"
    },
    {
        "id": 1,
        "name": "Nonlinear ODEs and Linear PDEs Equivalence Project",
        "description": "This was a group research project for my Ordinary Differential Equations class that focuses on the transformations and equivalence of nonlinear ODEs and linear PDEs in the context of Fluid Dynamics. I independently created a LaTeX file to provide an alternative format for our presentation.",
        "link": "https://github.com/Romerico234/Nonlinear-ODEs-and-Linear-PDEs-Equivalence-in-Fluid-Dynamics",
        "image": "../../../images/projects-images/differential-equations-equivalence.png"
    }
]
