[
    {
        "id": 1,
        "company": "Uber",
        "location": "TBD",
        "jobTitle": "Software Engineering Intern",
        "startDate": "Nov 2024",
        "endDate": "present",
        "description": "Incoming Summer 2025."
    },
    {
        "id": 2,
        "company": "SecurEd Inc",
        "location": "Towson, MD",
        "jobTitle": "Junior Software Developer",
        "startDate": "Aug 2024",
        "endDate": "present",
        "description": "I am working on the CLARK and Cyber Competencies products to improve user engagement and platform usability. My role includes building scalable RESTful APIs using the MEAN stack and developing tests for platform stability. I also collaborate in Agile sprints and use GitHub for version control to ensure high-quality code and efficient teamwork."
    },
    {
        "id": 3,
        "company": "Towson University",
        "location": "Towson, MD",
        "jobTitle": "Computer Science Peer Tutor",
        "startDate": "Feb 2024",
        "endDate": "present",
        "description": "I provide drop-in tutoring sessions for up to 10 students, focusing on Java, Python, and C++. My role involves assisting students in understanding fundamental concepts in data structures, algorithms, and both structured and object-oriented programming principles."
    },
    {
        "id": 4,
        "company": "Towson University",
        "location": "Towson, MD",
        "jobTitle": "Undergraduate Researcher in Federated Learning",
        "startDate": "Aug 2023",
        "endDate": "Jan 2024",
        "description": "As an Undergraduate Researcher in Federated Learning at Towson University, I used the Flower Federated Learning (FL) framework, which is based on TensorFlow. My research focused on evaluating and comparing FL aggregation methods like FedAvg, FedProx, and QffedAvg under various types of model poisoning attacks during the data processing and model training stages."
    },
    {
        "id": 5,
        "company": "Towson University",
        "location": "Towson, MD",
        "jobTitle": "Research Intern",
        "startDate": "June 2023",
        "endDate": "July 2023",
        "description": "I was selected as one of twelve students in the TIGURS summer undergraduate research program. I used PyTorch, NumPy, pandas, Matplotlib, and scikit-learn to explore concepts on artificial neural networks. I implemented and evaluated feed-forward, convolutional, and recurrent neural networks using the MNIST and CIFAR-10 datasets. I evaluated these networks on metrics such as Accuracy, Confusion Matrix, Precision, and Recall. "
    }
]
